Tekla Open API Reference for Tekla Structures 2025
AnalysisModelConnectivityRule Methods
The AnalysisModelConnectivityRule type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis connectivity rule. The ID has to be set.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisModelConnectivityRule Class
Tekla.Structures.Analysis Namespace